fitter/app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def create
    puts "testing"
    @comment = Comment.new(comment_params)
    puts "testing 2"
    @post = Post.find(params[:post_id])