fitter/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @user = User.find(params[:user_id])
    @post.user = @user

    if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at", "exercise_type", "exercise_duration", "calories") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy_single
    @post = Post.new(post_params)
    @user = User.find(params[:user_id])
    @post.user = @user
    @post.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 16]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = $1, "content" = $2, "exercise_type" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "new title"], ["content", "I crushed White Claws!"], ["exercise_type", "Drinking"], ["updated_at", "2020-07-15 21:01:07.784388"], ["id", 13]]