fitter/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "location", "age", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"